#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		// Заполнение шапки
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка.Договор,
		|	РеализацияТоваровУслугТовары.Ссылка.Комментарий,
		|	РеализацияТоваровУслугТовары.Ссылка.Контрагент,
		|	РеализацияТоваровУслугТовары.Ссылка.Организация,
		|	РеализацияТоваровУслугТовары.Ссылка.Ответственный,
		|	РеализацияТоваровУслугТовары.Ссылка.Основание,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.Количество
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Выборка.Следующий();
		Договор = Выборка.Договор;
		Комментарий = Выборка.Комментарий;
		Контрагент = Выборка.Контрагент;
		Организация = Выборка.Организация;
		Ответственный = Выборка.Ответственный;
		Основание = Выборка.Основание;
		
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = Выборка.Количество;
			НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		КонецЦикла;

	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли